op_Multiply(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the product of scale * vect.
\param scale [in] Scale factor to be multiplied with vector.
\param vect [in] Any 3D vector to be multiplied with scale factor.

op_Multiply(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the product of matrix * vect.
\param matrix [in] Any 3D *matrix* to be multiplied with vector.
\param vect [in] Any 3D vector to be multiplied with matrix.

op_Multiply(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Sets this point to the result of the matrix multiplication of matrix * point.
\param matrix [in]  Any 3D matrix.
\param point [in]  The point to be multiplied.

op_Multiply(OdGeMatrix2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\remarks
Sets this point to the result of the matrix multiplication of matrix * point.
\param matrix [in]  Any 2D matrix.
\param point [in]  The point to be multiplied.